public class algoritm11 {
    public static void main(String[] args) {
         System.out.println("Разделить монеты на три группы по девять монет и сравнить массы двух из них." +
                 " Если при этом на чашечных весах не получилось равенства," +
                 " то фальшивая монета содержится среди девяти более лёгких монет. Если же получилось равенство," +
                 " то фальшивая монета может содержаться только среди девяти монет," +
                 " не принимавших участие во взвешивании.\n");
         System.out.println("Разделить девять монет на три группы по три монеты и взвесить две из этих групп." +
                 " Аналогично предыдущему после этого будет выделена группа из трёх монет," +
                 " среди которых есть фальшивая.\n");
         System.out.println("Последним взвешиванием сравнить массы двух" +
                 " монет из этих трёх и определить фальшивую монету.\n" );
    }
}
