public class algoritm4 {
    public static void main(String[] args) {
        System.out.println("В подогретое до комнатной температуры молоко (30–40 °С)" +
                " добавляют соль, дрожжи и хорошо всё перемешивают.\n");
        System.out.println("В массу добавляют яйцо и просеянную муку." +
                " Замешивают тесто в комок. В конце замеса добавляют растительное масло и всё тщательно вымешивают." +
                "\n");
        System.out.println("Накрывают тесто плёнкой, ставят в тёплое место на 1 час.\n" );
        System.out.println("После подъёма тесто выкладывают на смазанный маслом противень и растягивают.\n" );
        System.out.println("Поверхность теста покрывают соусом из майонеза и кетчупа.\n" );
        System.out.println("Следующий слой — нарезанная кубиком или соломкой колбаса.\n");
        System.out.println("Сверху посыпают тёртым сыром и ставят в духовку на 30–40 минут" +
                " при температуре 200–220 °С.\n");
    }
}
