public class algoritm7 {
    public static void main(String[] args) {
        System.out.println("Золушка берёт шесть видов фасоли\n");
        System.out.println("Золушка использует первый вид фасоли их всего 4 и эта фасоль создаёт колёса\n");
        System.out.println("золушка использует 2 вид фасолей и создаёт 3 лошадей этих фасолей всего 33\n");
        System.out.println("Золушка использует 3 вид фасолей и создаёт карету их всего у неё 40 \n");
        System.out.println("Золушка использует 4 вид фасолей  и создаёт свой отель их всего 50\n");
        System.out.println("Золушка использует 5 вид фасолей и превращает свои стены в хрусталь их всего 60\n");
        System.out.println("Золушка использует 6 вид фасолей и " +
                "превращает свою одежду в царскую ожежду и идёт на бал к принцу их всего 70\n");
        System.out.println("Все виды фасолей:1) чёрный 2) коричневый 3)голубой 4) золотой 5) хрусталь 6) волшебная\n");

    }
}
